src/Configuration/DataProcessors/МониторРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Configuration/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Configuration/AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Configuration/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОплатаДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Configuration/DataProcessors/МониторРуководителя/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	ЗаполнитьЧисловыеПоказатели(); 
	ЗаполнитьЧисловыеПоказатели();
	ЗаполнитьГистограммы();
	ЗаполнитьКруговыеДиаграммы();
КонецПроцедуры    



&НаКлиенте
Процедура МесяцСтрокойНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Подсказка = "Введите период получения данных";
	ЧастьДаты = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаПериода",ЭтотОбъект); 
	ПоказатьВводДаты(Оповещение, ПериодОбработки, Подсказка, ЧастьДаты); 	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВводаПериода(Результат, ДополнительныеПараметры) Экспорт    
	Если Результат<> Неопределено Тогда
		ПериодОбработки = НачалоМесяца(Результат); 
		МесяцСтрокой = Формат(ПериодОбработки, "ДФ='ММММ гггг'"); 
	КонецЕсли;    
	ЗаполнитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЧисловыеПоказатели()    
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки); //1
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ПродажиОбороты.Регистратор КАК Регистратор,
	|	ПродажиОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Продажи.СуммаОборот) КАК СуммаОборот
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Продажи.СуммаОборот) КАК СуммаОборот,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Продажи.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_КоличествоРегистраторов
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_КоличествоРегистраторов.Регистратор = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_КоличествоРегистраторов.СуммаОборот / ВТ_КоличествоРегистраторов.Регистратор КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК СреднийЧек
	|ИЗ
	|	ВТ_КоличествоРегистраторов КАК ВТ_КоличествоРегистраторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыКлиентов.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ЗаписиКлиентов
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
	|ГДЕ
	|	ЗаказыКлиентов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаказыКлиентов.Регистратор ССЫЛКА Документ.ЗаписьКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаписиКлиентов.Регистратор) КАК КоличествоЗаписейКлиентов
	|ИЗ
	|	ВТ_ЗаписиКлиентов КАК ВТ_ЗаписиКлиентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаписиКлиентов.Регистратор) КАК Завершенных
	|ИЗ
	|	ВТ_ЗаписиКлиентов КАК ВТ_ЗаписиКлиентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|		ПО ВТ_ЗаписиКлиентов.Регистратор = РеализацияТоваровИУслуг.Основание
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен";
	
	ВсегоЗаписей = 0; 
	
	РезультатПакет = Запрос.ВыполнитьПакет(); 
	
	ВыборкаПродажи = РезультатПакет[1].Выбрать(); 
	Если ВыборкаПродажи.Следующий() Тогда
		ВыручкаЧисло = ВыборкаПродажи.СуммаОборот;
	КонецЕсли;
	
	ВыборкаСреднийЧек = РезультатПакет[3].Выбрать();
	Если ВыборкаСреднийЧек.Следующий() Тогда
		СреднийЧек = ВыборкаСреднийЧек.СреднийЧек;
	КонецЕсли;
	
	ВыборкаЗаписиКлиентов = РезультатПакет[5].Выбрать();
	Если ВыборкаЗаписиКлиентов.Следующий() Тогда
		ВсегоЗаписей = ВыборкаЗаписиКлиентов.КоличествоЗаписейКлиентов;
	КонецЕсли;
	
	ВыборкаЗаписиКлиентовЗавершенные = РезультатПакет[6].Выбрать();
	Если ВыборкаЗаписиКлиентовЗавершенные.Следующий() Тогда
		Завершенных = ВыборкаЗаписиКлиентовЗавершенные.Завершенных;
		Если ВсегоЗаписей> 0 Тогда
			ПроцентЗавершенных = ОКР((100*Завершенных/ВсегоЗаписей),2);
			ЗавершенныхПроцентСтрока = СтрШаблон("Это %1 процентов от всех записей", ПроцентЗавершенных); 
		Иначе
			ЗавершенныхПроцентСтрока = "В этом периоде нет записей клиентов!";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	//МониторРуководителя Отображение
	ПериодОбработки = НачалоМесяца(ТекущаяДата()); 
	МесяцСтрокой = Формат(ПериодОбработки, "ДФ='ММММ гггг'"); 
	ЗаполнитьДанныеНаСервере();  
	//Новости Валюта   
	ДатаЗагрузки = Текущаядата();
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();   
	
	//Новости
	ДатаЗагрузкиНовостей = ТекущаяДата();
	КоличествоНовостей = 10;
	СтрокаПоиска = "Бизнес";
	ЯзыкПоиска = "Русский";
	
	
	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьГистограммы()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    НачалоПериода(Продажи.Период, День) КАК Период,
	|    Продажи.СуммаОборот КАК СуммаОборот
	|ИЗ
	|    РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Продажи
	|
	|УПОРЯДОЧИТЬ ПО
	|    Период
	|ИТОГИ
	|    СУММА(СуммаОборот)
	|ПО
	|    Период ПЕРИОДАМИ(ДЕНЬ, &ДатаНачала, &ДатаОкончания)";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	ДиаграммаВыручка.Обновление = Ложь; 
	ДиаграммаВыручка.Очистить();
	
	Серия = ДиаграммаВыручка.Серии.Добавить("Оборот"); 
	Серия.Цвет = WebЦвета.ЛососьСветлый;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "Все"); //3
	
	Пока Выборка.Следующий() Цикл
		
		Точка = ДиаграммаВыручка.Точки.Добавить(Выборка.Период); 
		Точка.Текст = Формат(Выборка.Период, "ДФ=dd.MM.yy"); 
		Точка.Расшифровка = Выборка.Период;
		Подсказка = "Выручка " + Выборка.СуммаОборот + " на " + Формат(Выборка.Период, "ДФ=dd.MM.yyyy"); 
		ДиаграммаВыручка.УстановитьЗначение(Точка, Серия, Выборка.СуммаОборот, Точка.Расшифровка, Подсказка);//6
		
	КонецЦикла;
	
	ДиаграммаВыручка.Обновление = Истина; //7
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКруговыеДиаграммы()   
	МассивРезультатов = Обработки.МониторРуководителя.ПолучитьДанныеДляДиаграмм(ПериодОбработки);
	
	ЗаполнитьДиаграммуПоИсточникамИнформации(МассивРезультатов[0]);
	ЗаполнитьДиаграммуПоСотрудникам(МассивРезультатов[1]);
	ЗаполнитьДиаграммуПоУслугам(МассивРезультатов[5]);
	
КонецПроцедуры    

Процедура ЗаполнитьДиаграммуПоИсточникамИнформации(РезультатПакет)
	//Запрос = Новый запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""Не указан"") КАК ИсточникиИнформации,
	//|	ПродажиОбороты.СуммаОборот КАК Количество
	//|ИЗ
	//|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""Не указан""),
	//|	ПродажиОбороты.СуммаОборот";
	//Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	//Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	ДиаграммаПоРекламнымИсточникам.Обновление = Ложь;
	ДиаграммаПоРекламнымИсточникам.Очистить();
	
	Точка = ДиаграммаПоРекламнымИсточникам.Точки.Добавить("Количество");
	Точка.Текст = "Количество";
	Точка.ПриоритетЦвета = Ложь;
	
	Выборка = РезультатПакет.Выбрать();
	Пока Выборка.Следующий() Цикл
		Серия = ДиаграммаПоРекламнымИсточникам.Серии.Добавить(Выборка.ИсточникиИнформации);
		ДиаграммаПоРекламнымИсточникам.УстановитьЗначение(Точка, Серия, Выборка.Количество, Строка(Выборка.Количество));
	КонецЦикла;
	
	ДиаграммаПоРекламнымИсточникам.Обновление = Истина;
	
КонецПроцедуры        

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДанныеНаСервере ();
КонецПроцедуры

Процедура ЗаполнитьДиаграммуПоСотрудникам(РезультатПакет)
	//	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
	//|	ПродажиОбороты.Сотрудник.Представление КАК Сотрудник
	//|ИЗ
	//|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
	//|ГДЕ
	//|	ПродажиОбороты.СуммаОборот <> 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПродажиОбороты.Сотрудник.Представление";
	//
	//Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	//Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки)); 
	
	ДиаграммаВыручкаПоСотрудникам.Обновление = Ложь;
	ДиаграммаВыручкаПоСотрудникам.Очистить();
	
	Точка = ДиаграммаВыручкаПоСотрудникам.Точки.Добавить("Сумма");
	Точка.Текст = " Сумма";
	Точка.ПриоритетЦвета = Ложь;  
	
	Выборка = РезультатПакет.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Серия = ДиаграммаВыручкаПоСотрудникам.Серии.Добавить(Выборка.Сотрудник);
		ДиаграммаВыручкаПоСотрудникам.УстановитьЗначение(Точка, Серия, Выборка.Сумма, Строка(Выборка.Сумма));
	КонецЦикла;
	
	ДиаграммаВыручкаПоСотрудникам.Обновление = Истина;
	
КонецПроцедуры 

Процедура ЗаполнитьДиаграммуПоУслугам(РезультатПакет)

//Запрос = Новый Запрос;
//Запрос.Текст ="ВЫБРАТЬ
//              |	ПродажиОбороты.Номенклатура КАК Номенклатура,
//              |	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
//              |ПОМЕСТИТЬ ВТ_КонкретныеУслуги
//              |ИЗ
//              |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
//              |
//              |СГРУППИРОВАТЬ ПО
//              |	ПродажиОбороты.Номенклатура
//              |;
//              |
//              |////////////////////////////////////////////////////////////////////////////////
//              |ВЫБРАТЬ
//              |	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
//              |ПОМЕСТИТЬ ВТ_ВсеПродажи
//              |ИЗ
//              |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
//              |;
//              |
//              |////////////////////////////////////////////////////////////////////////////////
//              |ВЫБРАТЬ
//              |	ВТ_КонкретныеУслуги.Номенклатура КАК Номенклатура,
//              |	ВТ_КонкретныеУслуги.СуммаОборот КАК СуммаПродажНоменклатуры,
//              |	ВТ_ВсеПродажи.СуммаОборот КАК ОбщаяСуммаПоУслугам
//              |ПОМЕСТИТЬ ВТ_Предытог
//              |ИЗ
//              |	ВТ_КонкретныеУслуги КАК ВТ_КонкретныеУслуги
//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеПродажи КАК ВТ_ВсеПродажи
//              |		ПО (ИСТИНА)
//              |;
//              |
//              |////////////////////////////////////////////////////////////////////////////////
//              |ВЫБРАТЬ
//              |	ВЫБОР
//              |		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
//              |			ТОГДА ВТ_Предытог.Номенклатура.Представление
//              |		ИНАЧЕ ""Прочее""
//              |	КОНЕЦ КАК Номенклатура,
//              |	СУММА(ВТ_Предытог.СуммаПродажНоменклатуры) КАК Сумма
//              |ИЗ
//              |	ВТ_Предытог КАК ВТ_Предытог
//              |
//              |СГРУППИРОВАТЬ ПО
//              |	ВЫБОР
//              |		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
//              |			ТОГДА ВТ_Предытог.Номенклатура.Представление
//              |		ИНАЧЕ ""Прочее""
//              |	КОНЕЦ"     ;
//   
//Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
//Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));

ДиаграммаПоУслугам.Обновление = Ложь; //1
ДиаграммаПоУслугам.Очистить();

Точка = ДиаграммаПоУслугам.Точки.Добавить("Сумма"); //2
Точка.Текст = "Сумма";
Точка.ПриоритетЦвета = Ложь;

Выборка = РезультатПакет.Выбрать();
Пока Выборка.Следующий() Цикл

    Серия = ДиаграммаПоУслугам.Серии.Добавить(Выборка.Номенклатура); //3
    ДиаграммаПоУслугам.УстановитьЗначение(Точка, Серия, Выборка.Сумма, Строка(Выборка.Сумма));

КонецЦикла;

ДиаграммаПоУслугам.Обновление = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДатаЗагрузкиПриИзменении(Элемент)
ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере() 
	

Сервер = "cbr.ru"; //1
АдресЗапроса = "/scripts/XML_daily.asp?date_req=" + Формат(ДатаЗагрузки, "ДФ=dd/MM/yyyy"); //2

ВозвращаемоеЗначение = РаботаСHHTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса); //3

Если ВозвращаемоеЗначение.УспешныйЗапрос = Ложь Тогда //4
    Сообщить(ВозвращаемоеЗначение.ТекстОшибки);
    возврат;
ИначеЕсли ВозвращаемоеЗначение.HTTPОтвет.КодСостояния <> 200 Тогда //5
    Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемоеЗначение.HTTPОтвет.КодСостояния));
    возврат;
КонецЕсли;

СтрокаXML = ВозвращаемоеЗначение.HTTPОтвет.ПолучитьТелоКакСтроку(); //6
ПрочитатьИзXMLПоследовательно(СтрокаXML); //7

КонецПроцедуры

&НаСервере
Процедура ПрочитатьИзXMLПоследовательно(СтрокаXML)

ЧтениеXML = Новый ЧтениеXML;
ЧтениеXML.УстановитьСтроку(СтрокаXML); //1

Валюта = Неопределено;

Пока ЧтениеXML.Прочитать() Цикл //2

    //ищем ID= R01235 (доллар) R01375 (юань) R01239 (евро)

    Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

        НужнаяВалюта = Ложь;

        Пока ЧтениеXML.ПрочитатьАтрибут() Цикл //3
            Если  ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01235" Тогда
                Валюта = "USD";
            ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01239" Тогда
                Валюта = "EURO";
            ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01375" Тогда
                Валюта = "CNY";
            Иначе
                Валюта = Неопределено;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;

    Если Валюта <> Неопределено
        И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
        И ЧтениеXML.Имя = "VunitRate" Тогда
        ЧтениеXML.Прочитать();
        Если Валюта = "USD" Тогда //4
            КурсДоллараНаСегодня = ЧтениеXML.Значение;
        ИначеЕсли Валюта = "EURO" Тогда
            КурсЕвроНаСегодня = ЧтениеXML.Значение;
        ИначеЕсли Валюта = "CNY" Тогда
            КурсЮаняНаСегодня = ЧтениеXML.Значение;
        КонецЕсли;
    КонецЕсли;
КонецЦикла;

ЧтениеXML.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНовости(Команда)
	ОбновитьНовостиНаСервере();
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНовостиНаСервере()
ТипНовости = "";

Сервер = "newsapi.org"; 
АдресЗапроса = "/v2/everything";       
	
ПараметрыЗапроса = СтрШаблон("apiKey=%1&sortBy=popularity&from=%2&q=%3&language=%4", СокрЛП(Константы.API_KEY_newsapi.Получить()),
    Формат(ДатаЗагрузкиНовостей, "ДФ=yyyy-MM-dd"), СокрЛП(СтрокаПоиска), ЯзыкПоиска); 

АдресЗапроса = АдресЗапроса + "?" + ПараметрыЗапроса; 

ВозвращаемоеЗначение = РаботаСHHTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса);

Если ВозвращаемоеЗначение.УспешныйЗапрос = Ложь Тогда 
	Сообщить(ВозвращаемоеЗначение.ТекстОшибки);
    возврат;
ИначеЕсли ВозвращаемоеЗначение.HTTPОтвет.КодСостояния <> 200 Тогда
    Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемоеЗначение.HTTPОтвет.КодСостояния)); 
	    возврат;
КонецЕсли;

СтрокаJSON = ВозвращаемоеЗначение.HTTPОтвет.ПолучитьТелоКакСтроку();  
  Сообщить("Длина JSON: " + СтрДлина(СтрокаJSON));
                                                                            
ЧтениеJSON = Новый ЧтениеJSON;
ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
Новости = ПрочитатьJSON(ЧтениеJSON, Ложь);
ЧтениеJSON.Закрыть();

Итератор = 1;

Если Новости <> Неопределено Тогда   
	    Для Каждого Статья Из Новости.articles Цикл
        ТипНовости = ТипНовости + Строка(Итератор) + ") " + "Источник: " + Статья.url + Символы.ПС + Статья.title + Символы.ПС;
        ТипНовости = ТипНовости + Статья.description + Символы.ПС + Символы.ПС;
        Если Итератор = КоличествоНовостей Тогда
           прервать;
       КонецЕсли;
       Итератор = Итератор + 1;
   КонецЦикла;
       
   Иначе
        Сообщить("Новости не найдены или структура JSON не соответствует ожидаемой");
        НовостиДляОтображения = "Новости не найдены";
    КонецЕсли;

КонецПроцедуры
